---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GbxmlEditDataParam
source: html/598f04eb-d94a-b2fc-ae2f-5b597fa3461d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GbxmlEditDataParam Property

"Energy Settings"

## Syntax (C#)
```csharp
public static ForgeTypeId GbxmlEditDataParam { get; }
```